reversing/challenge8.org
#+TITLE: Challenge 8
#+AUTHOR: 8dcc
#+OPTIONS: toc:nil
#+STARTUP: nofold
#+HTML_HEAD: <link rel="icon" type="image/x-icon" href="../img/favicon.png" />
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="../css/main.css" />

[[file:../index.org][Index]] | [[file:index.org][Up]]

-----

#+TOC: headlines 2

* Original assembly
:PROPERTIES:
:CUSTOM_ID: original-assembly
:END:

Original challenge link: [[https://challenges.re/8/][Click me]].

#+begin_src nasm
func:
   0:       push   r12
   2:       test   rsi, rsi
   5:       mov    r12, rdi
   8:       push   rbp
   9:       mov    rbp, rdx
   c:       push   rbx
   d:       mov    rbx, rsi
  10:       je     32
  12:       nop    WORD [rax + rax * 1 + 0x0]
  18:       mov    rsi, QWORD [rbx]
  1b:       mov    rdi, rbp
  1e:       call   r12
  21:       test   eax, eax
  23:       je     56
  25:       js     40
  27:       mov    rbx, QWORD [rbx + 0x18]
  2b:       test   rbx, rbx
  2e:       xchg   ax, ax
  30:       jne    18
  32:       pop    rbx
  33:       pop    rbp
  34:       xor    eax, eax
  36:       pop    r12
  38:       ret
  39:       nop    DWORD [rax + 0x0]
  40:       mov    rbx, QWORD [rbx + 0x10]
  44:       test   rbx, rbx
  47:       je     32
  49:       mov    rsi, QWORD [rbx]
  4c:       mov    rdi, rbp
  4f:       call   r12
  52:       test   eax, eax
  54:       jne    25
  56:       mov    rax, rbx
  59:       pop    rbx
  5a:       pop    rbp
  5b:       pop    r12
  5d:       ret
#+end_src

After removing the unused labels, and renaming the used ones.

#+begin_src nasm
func:
    push   r12
    test   rsi, rsi
    mov    r12, rdi
    push   rbp
    mov    rbp, rdx
    push   rbx
    mov    rbx, rsi
    je     .return_zero
    nop
.unk0:
    mov    rsi, QWORD [rbx]
    mov    rdi, rbp
    call   r12
    test   eax, eax
    je     .return_rbx
.unk1:
    js     .unk2
    mov    rbx, QWORD [rbx + 0x18]
    test   rbx, rbx
    xchg   ax, ax  ; (nop)
    jne    .unk0
.return_zero:
    pop    rbx
    pop    rbp
    xor    eax, eax
    pop    r12
    ret
    nop
.unk2:
    mov    rbx, QWORD [rbx + 0x10]
    test   rbx, rbx
    je     .return_zero
    mov    rsi, QWORD [rbx]
    mov    rdi, rbp
    call   r12
    test   eax, eax
    jne    .unk1
.return_rbx:
    mov    rax, rbx
    pop    rbx
    pop    rbp
    pop    r12
    ret
#+end_src

* Assembly notes
:PROPERTIES:
:CUSTOM_ID: assembly-notes
:END:

These are some notes I considered important when translating the assembly into C
code.

