reversing/challenge8.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Challenge 8</title>
<meta name="author" content="8dcc" />
<meta name="generator" content="Org Mode" />
<link rel="icon" type="image/x-icon" href="../img/favicon.png" />
<link rel="stylesheet" type="text/css" href="../css/main.css" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">Challenge 8</h1>
<p>
<a href="../index.html">Index</a> | <a href="index.html">Up</a>
</p>

<hr />

<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#original-assembly">1. Original assembly</a></li>
<li><a href="#assembly-notes">2. Assembly notes</a>
<ul>
<li><a href="#second-parameter-array-or-struct">2.1. Second parameter: Array or struct</a></li>
<li><a href="#getting-the-return-value-of-the-r12-function">2.2. Getting the return value of the <code>r12</code> function</a></li>
</ul>
</li>
<li><a href="#c-translation">3. C translation</a></li>
<li><a href="#function-purpose">4. Function purpose</a></li>
</ul>
</div>
</div>

<div id="outline-container-original-assembly" class="outline-2">
<h2 id="original-assembly"><span class="section-number-2">1.</span> Original assembly</h2>
<div class="outline-text-2" id="text-original-assembly">
<p>
Original challenge link: <a href="https://challenges.re/8/">Click me</a>.
</p>

<div class="org-src-container">
<pre class="src src-nasm"><span style="color: #4ae2ff;">func</span>:
   <span style="color: #88ca9f;">0</span>:       <span style="color: #feacd0;">push</span>   <span style="color: #6ae4b9;">r12</span>
   <span style="color: #88ca9f;">2</span>:       <span style="color: #feacd0;">test</span>   <span style="color: #6ae4b9;">rsi</span>, <span style="color: #6ae4b9;">rsi</span>
   <span style="color: #88ca9f;">5</span>:       <span style="color: #feacd0;">mov</span>    <span style="color: #6ae4b9;">r12</span>, <span style="color: #6ae4b9;">rdi</span>
   <span style="color: #88ca9f;">8</span>:       <span style="color: #feacd0;">push</span>   <span style="color: #6ae4b9;">rbp</span>
   <span style="color: #88ca9f;">9</span>:       <span style="color: #feacd0;">mov</span>    <span style="color: #6ae4b9;">rbp</span>, <span style="color: #6ae4b9;">rdx</span>
   <span style="color: #4ae2ff;">c</span>:       <span style="color: #feacd0;">push</span>   <span style="color: #6ae4b9;">rbx</span>
   <span style="color: #4ae2ff;">d</span>:       <span style="color: #feacd0;">mov</span>    <span style="color: #6ae4b9;">rbx</span>, <span style="color: #6ae4b9;">rsi</span>
  <span style="color: #88ca9f;">10</span>:       <span style="color: #feacd0;">je</span>     <span style="color: #88ca9f;">32</span>
  <span style="color: #88ca9f;">12</span>:       <span style="color: #feacd0;">nop</span>    <span style="color: #79a8ff;">WORD</span> [<span style="color: #6ae4b9;">rax</span> + <span style="color: #6ae4b9;">rax</span> * <span style="color: #88ca9f;">1</span> + <span style="color: #88ca9f;">0x0</span>]
  <span style="color: #88ca9f;">18</span>:       <span style="color: #feacd0;">mov</span>    <span style="color: #6ae4b9;">rsi</span>, <span style="color: #79a8ff;">QWORD</span> [<span style="color: #6ae4b9;">rbx</span>]
  <span style="color: #88ca9f;">1b</span>:       <span style="color: #feacd0;">mov</span>    <span style="color: #6ae4b9;">rdi</span>, <span style="color: #6ae4b9;">rbp</span>
  <span style="color: #88ca9f;">1e</span>:       <span style="color: #feacd0;">call</span>   <span style="color: #6ae4b9;">r12</span>
  <span style="color: #88ca9f;">21</span>:       <span style="color: #feacd0;">test</span>   <span style="color: #6ae4b9;">eax</span>, <span style="color: #6ae4b9;">eax</span>
  <span style="color: #88ca9f;">23</span>:       <span style="color: #feacd0;">je</span>     <span style="color: #88ca9f;">56</span>
  <span style="color: #88ca9f;">25</span>:       <span style="color: #feacd0;">js</span>     <span style="color: #88ca9f;">40</span>
  <span style="color: #88ca9f;">27</span>:       <span style="color: #feacd0;">mov</span>    <span style="color: #6ae4b9;">rbx</span>, <span style="color: #79a8ff;">QWORD</span> [<span style="color: #6ae4b9;">rbx</span> + <span style="color: #88ca9f;">0x18</span>]
  <span style="color: #88ca9f;">2b</span>:       <span style="color: #feacd0;">test</span>   <span style="color: #6ae4b9;">rbx</span>, <span style="color: #6ae4b9;">rbx</span>
  <span style="color: #88ca9f;">2e</span>:       <span style="color: #feacd0;">xchg</span>   <span style="color: #6ae4b9;">ax</span>, <span style="color: #6ae4b9;">ax</span>
  <span style="color: #88ca9f;">30</span>:       <span style="color: #feacd0;">jne</span>    <span style="color: #88ca9f;">18</span>
  <span style="color: #88ca9f;">32</span>:       <span style="color: #feacd0;">pop</span>    <span style="color: #6ae4b9;">rbx</span>
  <span style="color: #88ca9f;">33</span>:       <span style="color: #feacd0;">pop</span>    <span style="color: #6ae4b9;">rbp</span>
  <span style="color: #88ca9f;">34</span>:       <span style="color: #feacd0;">xor</span>    <span style="color: #6ae4b9;">eax</span>, <span style="color: #6ae4b9;">eax</span>
  <span style="color: #88ca9f;">36</span>:       <span style="color: #feacd0;">pop</span>    <span style="color: #6ae4b9;">r12</span>
  <span style="color: #88ca9f;">38</span>:       <span style="color: #feacd0;">ret</span>
  <span style="color: #88ca9f;">39</span>:       <span style="color: #feacd0;">nop</span>    <span style="color: #79a8ff;">DWORD</span> [<span style="color: #6ae4b9;">rax</span> + <span style="color: #88ca9f;">0x0</span>]
  <span style="color: #88ca9f;">40</span>:       <span style="color: #feacd0;">mov</span>    <span style="color: #6ae4b9;">rbx</span>, <span style="color: #79a8ff;">QWORD</span> [<span style="color: #6ae4b9;">rbx</span> + <span style="color: #88ca9f;">0x10</span>]
  <span style="color: #88ca9f;">44</span>:       <span style="color: #feacd0;">test</span>   <span style="color: #6ae4b9;">rbx</span>, <span style="color: #6ae4b9;">rbx</span>
  <span style="color: #88ca9f;">47</span>:       <span style="color: #feacd0;">je</span>     <span style="color: #88ca9f;">32</span>
  <span style="color: #88ca9f;">49</span>:       <span style="color: #feacd0;">mov</span>    <span style="color: #6ae4b9;">rsi</span>, <span style="color: #79a8ff;">QWORD</span> [<span style="color: #6ae4b9;">rbx</span>]
  <span style="color: #88ca9f;">4c</span>:       <span style="color: #feacd0;">mov</span>    <span style="color: #6ae4b9;">rdi</span>, <span style="color: #6ae4b9;">rbp</span>
  <span style="color: #88ca9f;">4f</span>:       <span style="color: #feacd0;">call</span>   <span style="color: #6ae4b9;">r12</span>
  <span style="color: #88ca9f;">52</span>:       <span style="color: #feacd0;">test</span>   <span style="color: #6ae4b9;">eax</span>, <span style="color: #6ae4b9;">eax</span>
  <span style="color: #88ca9f;">54</span>:       <span style="color: #feacd0;">jne</span>    <span style="color: #88ca9f;">25</span>
  <span style="color: #88ca9f;">56</span>:       <span style="color: #feacd0;">mov</span>    <span style="color: #6ae4b9;">rax</span>, <span style="color: #6ae4b9;">rbx</span>
  <span style="color: #88ca9f;">59</span>:       <span style="color: #feacd0;">pop</span>    <span style="color: #6ae4b9;">rbx</span>
  <span style="color: #88ca9f;">5a</span>:       <span style="color: #feacd0;">pop</span>    <span style="color: #6ae4b9;">rbp</span>
  <span style="color: #88ca9f;">5b</span>:       <span style="color: #feacd0;">pop</span>    <span style="color: #6ae4b9;">r12</span>
  <span style="color: #88ca9f;">5d</span>:       <span style="color: #feacd0;">ret</span>
</pre>
</div>

<p>
After removing the unused labels, and renaming the used ones.
</p>

<div class="org-src-container">
<pre class="src src-nasm"><span style="color: #4ae2ff;">func</span>:
    <span style="color: #feacd0;">push</span>   <span style="color: #6ae4b9;">r12</span>
    <span style="color: #feacd0;">test</span>   <span style="color: #6ae4b9;">rsi</span>, <span style="color: #6ae4b9;">rsi</span>
    <span style="color: #feacd0;">mov</span>    <span style="color: #6ae4b9;">r12</span>, <span style="color: #6ae4b9;">rdi</span>
    <span style="color: #feacd0;">push</span>   <span style="color: #6ae4b9;">rbp</span>
    <span style="color: #feacd0;">mov</span>    <span style="color: #6ae4b9;">rbp</span>, <span style="color: #6ae4b9;">rdx</span>
    <span style="color: #feacd0;">push</span>   <span style="color: #6ae4b9;">rbx</span>
    <span style="color: #feacd0;">mov</span>    <span style="color: #6ae4b9;">rbx</span>, <span style="color: #6ae4b9;">rsi</span>
    <span style="color: #feacd0;">je</span>     .return_zero
    <span style="color: #feacd0;">nop</span>
<span style="color: #4ae2ff;">.unk0</span>:
    <span style="color: #feacd0;">mov</span>    <span style="color: #6ae4b9;">rsi</span>, <span style="color: #79a8ff;">QWORD</span> [<span style="color: #6ae4b9;">rbx</span>]
    <span style="color: #feacd0;">mov</span>    <span style="color: #6ae4b9;">rdi</span>, <span style="color: #6ae4b9;">rbp</span>
    <span style="color: #feacd0;">call</span>   <span style="color: #6ae4b9;">r12</span>
    <span style="color: #feacd0;">test</span>   <span style="color: #6ae4b9;">eax</span>, <span style="color: #6ae4b9;">eax</span>
    <span style="color: #feacd0;">je</span>     .return_rbx
<span style="color: #4ae2ff;">.unk1</span>:
    <span style="color: #feacd0;">js</span>     .unk2
    <span style="color: #feacd0;">mov</span>    <span style="color: #6ae4b9;">rbx</span>, <span style="color: #79a8ff;">QWORD</span> [<span style="color: #6ae4b9;">rbx</span> + <span style="color: #88ca9f;">0x18</span>]
    <span style="color: #feacd0;">test</span>   <span style="color: #6ae4b9;">rbx</span>, <span style="color: #6ae4b9;">rbx</span>
    <span style="color: #feacd0;">xchg</span>   <span style="color: #6ae4b9;">ax</span>, <span style="color: #6ae4b9;">ax</span>  <span style="color: #989898;">; </span><span style="color: #989898;">(nop)</span>
    <span style="color: #feacd0;">jne</span>    .unk0
<span style="color: #4ae2ff;">.return_zero</span>:
    <span style="color: #feacd0;">pop</span>    <span style="color: #6ae4b9;">rbx</span>
    <span style="color: #feacd0;">pop</span>    <span style="color: #6ae4b9;">rbp</span>
    <span style="color: #feacd0;">xor</span>    <span style="color: #6ae4b9;">eax</span>, <span style="color: #6ae4b9;">eax</span>
    <span style="color: #feacd0;">pop</span>    <span style="color: #6ae4b9;">r12</span>
    <span style="color: #feacd0;">ret</span>
    <span style="color: #feacd0;">nop</span>
<span style="color: #4ae2ff;">.unk2</span>:
    <span style="color: #feacd0;">mov</span>    <span style="color: #6ae4b9;">rbx</span>, <span style="color: #79a8ff;">QWORD</span> [<span style="color: #6ae4b9;">rbx</span> + <span style="color: #88ca9f;">0x10</span>]
    <span style="color: #feacd0;">test</span>   <span style="color: #6ae4b9;">rbx</span>, <span style="color: #6ae4b9;">rbx</span>
    <span style="color: #feacd0;">je</span>     .return_zero
    <span style="color: #feacd0;">mov</span>    <span style="color: #6ae4b9;">rsi</span>, <span style="color: #79a8ff;">QWORD</span> [<span style="color: #6ae4b9;">rbx</span>]
    <span style="color: #feacd0;">mov</span>    <span style="color: #6ae4b9;">rdi</span>, <span style="color: #6ae4b9;">rbp</span>
    <span style="color: #feacd0;">call</span>   <span style="color: #6ae4b9;">r12</span>
    <span style="color: #feacd0;">test</span>   <span style="color: #6ae4b9;">eax</span>, <span style="color: #6ae4b9;">eax</span>
    <span style="color: #feacd0;">jne</span>    .unk1
<span style="color: #4ae2ff;">.return_rbx</span>:
    <span style="color: #feacd0;">mov</span>    <span style="color: #6ae4b9;">rax</span>, <span style="color: #6ae4b9;">rbx</span>
    <span style="color: #feacd0;">pop</span>    <span style="color: #6ae4b9;">rbx</span>
    <span style="color: #feacd0;">pop</span>    <span style="color: #6ae4b9;">rbp</span>
    <span style="color: #feacd0;">pop</span>    <span style="color: #6ae4b9;">r12</span>
    <span style="color: #feacd0;">ret</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-assembly-notes" class="outline-2">
<h2 id="assembly-notes"><span class="section-number-2">2.</span> Assembly notes</h2>
<div class="outline-text-2" id="text-assembly-notes">
<p>
These are some notes I considered important when translating the assembly into C
code.
</p>
</div>
