reversing/challenge8.org
** Second parameter: Array or struct
:PROPERTIES:
:CUSTOM_ID: second-parameter-array-or-struct
:END:

The second parameter of the function is loaded into =rbx=, and is dereferenced
throughout the function. By that we can tell that it's a pointer, and all the
used elements are 64 bits long ([[https://en.wikipedia.org/wiki/Word_(computer_architecture)#Size_families][QWORD]]).

At first, I thought this was an array of pointers, since the value in
=[rbx + 0x10]= is dereferenced again into =rbx=, so I thought the function traversed
an array of unknown depth. However, there is no iteration, no pointer being
increased, and the function only works with =rbx[0]=, =rbx[2]= and =rbx[3]=.

I was talking about this with a friend, and he told me that this might be
related to linked lists, and that's when I realized that instead of an array, it
might be accessing a structure, and accessing the pointers at =[rbx + 0x10]= and
=[rbx + 0x18]= to jump to the previous and next elements in the linked list.

** Getting the return value of the =r12= function
:PROPERTIES:
:CUSTOM_ID: getting-the-return-value-of-the-r12-function
:END:

The first argument of our function is moved from =rdi= to =r12=. At some point, we
call the function at the address in =r12=, so we know the first parameter is a
pointer to some callback function. We can tell the type of the parameters
because we pass =rbp= and =rbx=, which at this point hold the 2nd and 3rd parameters
of our function.

For the return value, we can see that it's signed, and likely 32-bits because we
not only =test eax=, but we also check if the sign flag (SF) is set with a =js= jump
(jump if less than zero[fn::See Intel SDM, Vol. 1, Chapter 3.4.3.1 /Status Flags/,
Vol. 1, Chapter 5.1.7 /Control Transfer Instructions/ and Vol.2, /Jcc/
(pp. 3-537)]).

For the C translation, I will create a =callback_t= typedef so the parameter type
is more readable.

* C translation
:PROPERTIES:
:CUSTOM_ID: c-translation
:END:

The first version uses register names, treats =rbx= as an array, and is a bit more
messy when it comes to branching.

Note how the assembly calls the =r12= function in =unk2=, and then checks if it's
not zero *directly before jumping* to =unk1= with the =jne= instruction (which is
equivalent to =jnz=). This is the same check that is made at the bottom of =unk0=,
and overlooking this =jne= detail was making me think that it was *unconditionally*
jumping to =unk1= instead of =unk0= *specifically* because it wanted to skip this zero
check.

#+begin_src C
typedef int (*callback_t)(uint64_t, uint64_t*);

uint64_t* func(callback_t r12, uint64_t* rbx, uint64_t rbp) {
    if (rbx == NULL)
        return 0;

    for (;;) {
        /* unk0 */
        int eax = r12(rbp, rbx[0]);
        if (eax == 0)
            return rbx;

        /* unk1 */
        if (eax >= 0) {
            rbx = rbx[3];
            if (rbx == NULL)
                return 0;

            continue; /* goto unk0 */
        } else {
            /* unk2 */
            rbx = rbx[2];
            if (rbx == NULL)
                return 0;

            continue; /* goto unk0 */
        }
    }

    return rbx;
}
#+end_src

After analyzing what it does, renaming the parameters, and using a dummy
structure, I simplified it into this other version. I also returned =NULL= instead
of zero, since it normally returns =rbx= which is a pointer to a node.

#+begin_src C
typedef struct MyNode {
    uint64_t data0;
    uint64_t data1;
    struct MyNode* prev;
    struct MyNode* next;
} MyNode;

typedef int (*callback_t)(uint64_t, uint64_t);

MyNode* func(callback_t callback, MyNode* node, uint64_t data) {
    if (node == NULL)
        return NULL;

    for (;;) {
        /* unk0 */
        int result = callback(data, node->data0);
        if (result == 0)
            return node;

        if (result >= 0) {
            /* unk1 */
            node = node->next;
        } else {
            /* unk2 */
            node = node->prev;
        }

        if (node == NULL)
            return 0;
    }

    /* Not reached */
    return node;
}
#+end_src

As you can see, I also moved the duplicated =NULL= check outside of the =if=
statement.

