reversing/challenge8.html

<div id="outline-container-second-parameter-array-or-struct" class="outline-3">
<h3 id="second-parameter-array-or-struct"><span class="section-number-3">2.1.</span> Second parameter: Array or struct</h3>
<div class="outline-text-3" id="text-second-parameter-array-or-struct">
<p>
The second parameter of the function is loaded into <code>rbx</code>, and is dereferenced
throughout the function. By that we can tell that it&rsquo;s a pointer, and all the
used elements are 64 bits long (<a href="https://en.wikipedia.org/wiki/Word_(computer_architecture)#Size_families">QWORD</a>).
</p>

<p>
At first, I thought this was an array of pointers, since the value in
<code>[rbx + 0x10]</code> is dereferenced again into <code>rbx</code>, so I thought the function traversed
an array of unknown depth. However, there is no iteration, no pointer being
increased, and the function only works with <code>rbx[0]</code>, <code>rbx[2]</code> and <code>rbx[3]</code>.
</p>

<p>
I was talking about this with a friend, and he told me that this might be
related to linked lists, and that&rsquo;s when I realized that instead of an array, it
might be accessing a structure, and accessing the pointers at <code>[rbx + 0x10]</code> and
<code>[rbx + 0x18]</code> to jump to the previous and next elements in the linked list.
</p>
</div>
</div>

<div id="outline-container-getting-the-return-value-of-the-r12-function" class="outline-3">
<h3 id="getting-the-return-value-of-the-r12-function"><span class="section-number-3">2.2.</span> Getting the return value of the <code>r12</code> function</h3>
<div class="outline-text-3" id="text-getting-the-return-value-of-the-r12-function">
<p>
The first argument of our function is moved from <code>rdi</code> to <code>r12</code>. At some point, we
call the function at the address in <code>r12</code>, so we know the first parameter is a
pointer to some callback function. We can tell the type of the parameters
because we pass <code>rbp</code> and <code>rbx</code>, which at this point hold the 2nd and 3rd parameters
of our function.
</p>

<p>
For the return value, we can see that it&rsquo;s signed, and likely 32-bits because we
not only <code>test eax</code>, but we also check if the sign flag (SF) is set with a <code>js</code> jump
(Jump if less than zero). See <i>Intel SDM, Vol. 1, Chapter 3.4.3.1</i> and <i>Intel SDM,
Vol.2, Jcc</i> (Pg. 3-537).
</p>

<p>
For the C translation, I will create a <code>callback_t</code> typedef so the parameter type
is more readable.
</p>
</div>
</div>
</div>

<div id="outline-container-c-translation" class="outline-2">
<h2 id="c-translation"><span class="section-number-2">3.</span> C translation</h2>
<div class="outline-text-2" id="text-c-translation">
<p>
The first version uses register names, treats <code>rbx</code> as an array, and is a bit more
messy when it comes to branching.
</p>

<p>
Note how the assembly calls the <code>r12</code> function in <code>unk2</code>, and then checks if it&rsquo;s
not zero <b>directly before jumping</b> to <code>unk1</code> with the <code>jne</code> instruction (which is
equivalent to <code>jnz</code>). This is the same check that is made at the bottom of <code>unk0</code>,
and overlooking this <code>jne</code> detail was making me think that it was <b>unconditionally</b>
jumping to <code>unk1</code> instead of <code>unk0</code> <b>specifically</b> because it wanted to skip this zero
check.
</p>

<div class="org-src-container">
<pre class="src src-C"><span style="color: #ff6f9f;">typedef</span> <span style="color: #79a8ff;">int</span> (*<span style="color: #79a8ff;">callback_t</span>)(<span style="color: #79a8ff;">uint64_t</span>, <span style="color: #79a8ff;">uint64_t</span>*);

<span style="color: #79a8ff;">uint64_t</span>* <span style="color: #4ae2ff;">func</span>(<span style="color: #79a8ff;">callback_t</span> <span style="color: #6ae4b9;">r12</span>, <span style="color: #79a8ff;">uint64_t</span>* <span style="color: #6ae4b9;">rbx</span>, <span style="color: #79a8ff;">uint64_t</span> <span style="color: #6ae4b9;">rbp</span>) {
    <span style="color: #ff6f9f;">if</span> (rbx == <span style="color: #88ca9f;">NULL</span>)
        <span style="color: #ff6f9f;">return</span> <span style="color: #88ca9f;">0</span>;

    <span style="color: #ff6f9f;">for</span> (;;) {
        <span style="color: #989898;">/* </span><span style="color: #989898;">unk0</span><span style="color: #989898;"> */</span>
        <span style="color: #79a8ff;">int</span> <span style="color: #6ae4b9;">eax</span> = r12(rbp, rbx[<span style="color: #88ca9f;">0</span>]);
        <span style="color: #ff6f9f;">if</span> (eax == <span style="color: #88ca9f;">0</span>)
            <span style="color: #ff6f9f;">return</span> rbx;

        <span style="color: #989898;">/* </span><span style="color: #989898;">unk1</span><span style="color: #989898;"> */</span>
        <span style="color: #ff6f9f;">if</span> (eax &gt;= <span style="color: #88ca9f;">0</span>) {
            rbx = rbx[<span style="color: #88ca9f;">3</span>];
            <span style="color: #ff6f9f;">if</span> (rbx == <span style="color: #88ca9f;">NULL</span>)
                <span style="color: #ff6f9f;">return</span> <span style="color: #88ca9f;">0</span>;

            <span style="color: #ff6f9f;">continue</span>; <span style="color: #989898;">/* </span><span style="color: #989898;">goto unk0</span><span style="color: #989898;"> */</span>
        } <span style="color: #ff6f9f;">else</span> {
            <span style="color: #989898;">/* </span><span style="color: #989898;">unk2</span><span style="color: #989898;"> */</span>
            rbx = rbx[<span style="color: #88ca9f;">2</span>];
            <span style="color: #ff6f9f;">if</span> (rbx == <span style="color: #88ca9f;">NULL</span>)
                <span style="color: #ff6f9f;">return</span> <span style="color: #88ca9f;">0</span>;

            <span style="color: #ff6f9f;">continue</span>; <span style="color: #989898;">/* </span><span style="color: #989898;">goto unk0</span><span style="color: #989898;"> */</span>
        }
    }

    <span style="color: #ff6f9f;">return</span> rbx;
}
</pre>
</div>

<p>
After analyzing what it does, renaming the parameters, and using a dummy
structure, I simplified it into this other version. I also returned <code>NULL</code> instead
of zero, since it normally returns <code>rbx</code> which is a pointer to a node.
</p>

<div class="org-src-container">
<pre class="src src-C"><span style="color: #ff6f9f;">typedef</span> <span style="color: #ff6f9f;">struct</span> <span style="color: #79a8ff;">MyNode</span> {
    <span style="color: #79a8ff;">uint64_t</span> <span style="color: #6ae4b9;">data0</span>;
    <span style="color: #79a8ff;">uint64_t</span> <span style="color: #6ae4b9;">data1</span>;
    <span style="color: #ff6f9f;">struct</span> <span style="color: #79a8ff;">MyNode</span>* <span style="color: #6ae4b9;">prev</span>;
    <span style="color: #ff6f9f;">struct</span> <span style="color: #79a8ff;">MyNode</span>* <span style="color: #6ae4b9;">next</span>;
} <span style="color: #79a8ff;">MyNode</span>;

<span style="color: #ff6f9f;">typedef</span> <span style="color: #79a8ff;">int</span> (*<span style="color: #79a8ff;">callback_t</span>)(<span style="color: #79a8ff;">uint64_t</span>, <span style="color: #79a8ff;">uint64_t</span>);

<span style="color: #79a8ff;">MyNode</span>* <span style="color: #4ae2ff;">func</span>(<span style="color: #79a8ff;">callback_t</span> <span style="color: #6ae4b9;">callback</span>, <span style="color: #79a8ff;">MyNode</span>* <span style="color: #6ae4b9;">node</span>, <span style="color: #79a8ff;">uint64_t</span> <span style="color: #6ae4b9;">data</span>) {
    <span style="color: #ff6f9f;">if</span> (node == <span style="color: #88ca9f;">NULL</span>)
        <span style="color: #ff6f9f;">return</span> <span style="color: #88ca9f;">NULL</span>;

    <span style="color: #ff6f9f;">for</span> (;;) {
        <span style="color: #989898;">/* </span><span style="color: #989898;">unk0</span><span style="color: #989898;"> */</span>
        <span style="color: #79a8ff;">int</span> <span style="color: #6ae4b9;">result</span> = callback(data, node-&gt;data0);
        <span style="color: #ff6f9f;">if</span> (result == <span style="color: #88ca9f;">0</span>)
            <span style="color: #ff6f9f;">return</span> node;

        <span style="color: #ff6f9f;">if</span> (result &gt;= <span style="color: #88ca9f;">0</span>) {
            <span style="color: #989898;">/* </span><span style="color: #989898;">unk1</span><span style="color: #989898;"> */</span>
            node = node-&gt;next;
        } <span style="color: #ff6f9f;">else</span> {
            <span style="color: #989898;">/* </span><span style="color: #989898;">unk2</span><span style="color: #989898;"> */</span>
            node = node-&gt;prev;
        }

        <span style="color: #ff6f9f;">if</span> (node == <span style="color: #88ca9f;">NULL</span>)
            <span style="color: #ff6f9f;">return</span> <span style="color: #88ca9f;">0</span>;
    }

    <span style="color: #989898;">/* </span><span style="color: #989898;">Not reached</span><span style="color: #989898;"> */</span>
    <span style="color: #ff6f9f;">return</span> node;
}
</pre>
</div>

<p>
As you can see, I also moved the duplicated <code>NULL</code> check outside of the <code>if</code>
statement.
</p>
</div>
</div>
