reversing/challenge8.html

<div id="outline-container-function-purpose" class="outline-2">
<h2 id="function-purpose"><span class="section-number-2">4.</span> Function purpose</h2>
<div class="outline-text-2" id="text-function-purpose">
<p>
As we can see by the final C code, the function traverses a <a href="https://en.wikipedia.org/wiki/Doubly_linked_list">doubly linked list</a>
starting at <i>node</i>, moving left or right depending on the return value of a
<i>callback</i> function when checking against the provided <i>data</i>.
</p>

<p>
The <code>prev</code> and <code>next</code> members of <code>MyNode</code> don&rsquo;t have to be in that order, but they are
traversed like they appear in the function. Note how the first member of <code>node</code> is
passed to <code>callback</code>, not the node itself.
</p>

<p>
However, one thing is still unclear to me. If we read the description of the
challenge, we can see the following.
</p>

<blockquote>
<p>
This is one of the busiest algorithms under the hood, though, usually hidden
from programmers. It implements one of the most popular algorithms in computer
science. <b>It features recursion</b> and a callback function.
</p>
</blockquote>

<p>
If we look at our code again, there is no recursion. I asked the author of the
challenges, Dennis Yurichev, and he told me that his original function did use
recursion, and that it was a slightly different algorithm.
</p>

<p>
This function is for <b>searching a node in a binary tree</b>. I have never used it
personally, but I knew about it. The reason he says &ldquo;usually hidden from
programmers&rdquo; is because this algorithm is used in many map/dictionary
implementations for different languages.
</p>

<p>
In his code, the structure had an extra <code>parent</code> member which was not used. The
<i>callback</i> function is supposed to indicate if we should continue left or right in
the tree, and in his code, it&rsquo;s called recursively, rather than iteratively. I
also renamed some symbols to match my last example.
</p>

<div class="org-src-container">
<pre class="src src-C"><span style="color: #ff6f9f;">typedef</span> <span style="color: #ff6f9f;">struct</span> <span style="color: #79a8ff;">MyNode</span> {
    <span style="color: #79a8ff;">void</span>* <span style="color: #6ae4b9;">key</span>;
    <span style="color: #79a8ff;">void</span>* <span style="color: #6ae4b9;">value</span>;
    <span style="color: #ff6f9f;">struct</span> <span style="color: #79a8ff;">MyNode</span>* <span style="color: #6ae4b9;">left</span>;
    <span style="color: #ff6f9f;">struct</span> <span style="color: #79a8ff;">MyNode</span>* <span style="color: #6ae4b9;">right</span>;
} <span style="color: #79a8ff;">MyNode</span>;

<span style="color: #ff6f9f;">typedef</span> <span style="color: #79a8ff;">int</span> (*<span style="color: #79a8ff;">cmp_func_t</span>)(<span style="color: #79a8ff;">void</span>* <span style="color: #6ae4b9;">key1</span>, <span style="color: #79a8ff;">void</span>* <span style="color: #6ae4b9;">key2</span>);

<span style="color: #79a8ff;">MyNode</span>* <span style="color: #4ae2ff;">func</span>(<span style="color: #79a8ff;">cmp_func_t</span> <span style="color: #6ae4b9;">cmp_func</span>, <span style="color: #79a8ff;">MyNode</span>* <span style="color: #6ae4b9;">node</span>, <span style="color: #79a8ff;">void</span>* <span style="color: #6ae4b9;">key</span>) {
    <span style="color: #ff6f9f;">if</span> (node == <span style="color: #88ca9f;">NULL</span>)
        <span style="color: #ff6f9f;">return</span> <span style="color: #88ca9f;">NULL</span>;

    <span style="color: #79a8ff;">int</span> <span style="color: #6ae4b9;">cmp_result</span> = cmp_func(key, node-&gt;key);
    <span style="color: #ff6f9f;">if</span> (cmp_result == <span style="color: #88ca9f;">0</span>) {
        <span style="color: #ff6f9f;">return</span> node; <span style="color: #989898;">/* </span><span style="color: #989898;">Key found</span><span style="color: #989898;"> */</span>
    } <span style="color: #ff6f9f;">else</span> <span style="color: #ff6f9f;">if</span> (cmp_result &lt; <span style="color: #88ca9f;">0</span>) {
        <span style="color: #ff6f9f;">if</span> (node-&gt;left != <span style="color: #88ca9f;">NULL</span>)
            <span style="color: #ff6f9f;">return</span> func(cmp_func, node-&gt;left, key);
        <span style="color: #ff6f9f;">else</span>
            <span style="color: #ff6f9f;">return</span> <span style="color: #88ca9f;">NULL</span>; <span style="color: #989898;">/* </span><span style="color: #989898;">Leftmost node</span><span style="color: #989898;"> */</span>
    } <span style="color: #ff6f9f;">else</span> {
        <span style="color: #ff6f9f;">if</span> (node-&gt;right != <span style="color: #88ca9f;">NULL</span>)
            <span style="color: #ff6f9f;">return</span> func(cmp_func, node-&gt;right, key);
        <span style="color: #ff6f9f;">else</span>
            <span style="color: #ff6f9f;">return</span> <span style="color: #88ca9f;">NULL</span>; <span style="color: #989898;">/* </span><span style="color: #989898;">Rightmost node</span><span style="color: #989898;"> */</span>
    }
}
</pre>
</div>
</div>
</div>
</div>
</body>
</html>
